Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: དེས་ ཀྱང་ མཐོང་བ་ དེ་ ནི་ ཡིད་ཆེས་ གདའ །_།
en: Those who have seen them have conviction.

source: རྒྱལ་བ་ མཁས་པ ས་ སངས་རྒྱས་ འཕྲུལ་ དེ་ གཟིགས །_།
en: The skilled Victorious One has observed the awakened manifestation.

source: བཅོམ་ལྡན་ ཆོ་འཕྲུལ་ དེ་ འདྲ་ གདའ་བ་ ལགས །_།
en: Such was the miraculous display, Blessed One.

source: བཅོམ་ལྡན་ མི་ རྣམས་ ཀྱི་ ནི་ ཞིང་ རྒྱ་ ཆེ །_། |#| !བློ་ བུལ་ རྣམས་ ཀྱི་ སྟོན་པ་ དམ་པ་ ལགས །_།
en: $1874 “Blessed One, as the vast field for people, You are the sublime teacher of all guests.#85

source: བཅོམ་ལྡན་ སྐྱེ་དགུ འི་ སྲིད་ ཆགས་ བདེ་སྡུག་ བསྔལ །_། |#| འབྲས་བུ་ ཆེན་པོ་ བསྐྱེད་པ ར་ འགྱུར་ བ་ ལགས །_།
en: Blessed One, for the myriad beings who face pleasure and pain, You will have produced a great effect.

source: གལ་ཏེ་ བདག་ གིས་ སྙན་པ་ བསྐལ་ བརྗོད་ ཀྱང་ །_།
en: $1875 “Even were I to give voice to praises for eons,

source: བསྐལ་པ་ སྟོང་ དུའང་ ཟད་ བགྱིད་ རྔོ་ མི་ ཐོགས །_།
en: I could not finish even in a thousand eons.

source: གང་དག་ གོས་ ལས་ རྫུ་འཕྲུལ་ བསྒྲུབས་ གདའ་བ །_། ཐུབ་པ ས་ བསྟན་ འདི་ སུ་ ཡི་ དོན་ བགྱིད་ འགྱུར །_།
en: For whose benefit did the sage demonstrate The supernatural powers that were produced from the garment?

source: དེ་ ནི་ སུ་ ཡི་ རྒྱ་ ཆེན་ ཞིང་ དུ་ འགྱུར །_།
en: $1876 “Whose vast field will it be?

source: དེ་ ལ་ སུ་ཞིག་ བྱང་ཆུབ་ སྤྱད་ སྤྱོད་ ན །_། |#| འདི་ལྟར་ འདི་ ན་རྫུ་ འཕྲུལ་ དཔག་མེད་ གདའ །_།
en: Who will have such immeasurable supernatural powers, When practicing the conduct of awakening here?

source: འདྲེན་པ་ དེ་རིང་ བདག་ ལ་ལུང་ བསྟན་ གསོལ །_།
en: Guide, I beseech you to clarify this for me today.

source: ཤིང་རྟ འི་ ཕང་ལོ་ ཙམ་ གྱི་ པད་མ་ བརྩེགས །_། ཇི་ལྟ ར་ སྣ་ཚོགས་ མཛེས་པ་ བགྱིས་པ་ ལགས །_།
en: $1877 “How is it that lotuses the size of chariot wheels Adorn it in various colors?

source: ཇི་ལྟ ར་ བྱང་ཆུབ་ སེམས་དཔའ་ མང་པོ་ མཆིས །_། |#| ཕྱོགས་ བཅུ ར་ སངས་རྒྱས་ ལ་ ནི་ ཕྱག་ འཚལ་ མཆི །_། [213a]
en: How is it that many bodhisattvas have come And pay homage to the buddhas in the ten directions? [213.a]

source: སངས་རྒྱས་ ཕྱག་ འཚལ་ སླར་ཡང་ ཞིང་ དུ་ མཆི །_།
en: $1878 “After paying homage they will return to that realm.

source: དེ་ཉིད་ ནས་ ནི་ སླར་ མཆིས་ བྱང་ཆུབ་ འཐོབ །_།
en: As they then return to that place, they will attain awakening.

source: རྒྱ་ ཆེན་ ཞིང་ དེ་ རྣམ་པར་ དག་པ ར་ འགྱུར །_།
en: That vast realm will be purified.

source: རྫུ་འཕྲུལ་ བསམ་ གྱིས་ མི་ ཁྱབ་ གདའ་བ་ ལགས །_།
en: Inconceivable supernatural powers will be present.

source: བྱང་ཆུབ་ སྤྱད་པ་ སྤྱོད་པ་ དག་ ཀྱང་ མཐོང་ །_།
en: $1879 “Those practicing bodhisattva conduct will also be seen.

source: སངས་རྒྱས་ ཞིང་ འདི་ ན་ ནི་ དཔའ་བོ་ གཅིག _།_ གང་ཞིག་ ཆོས་གོས་ ཐོགས་ ནས་ གནས་པ་ ལགས །_། མ་ བསླབས་པ་ ཡིས་ འདི་ ལ་ ཇི་ལྟ ར་ བསླབ །_།
en: In this buddha realm there will be a single hero. |#| How will those who proffer to him the Dharma robes, Train in this by means of no training?#86

source: གང་ གིས་ སེམས་ཅན་ ཐམས་ཅད་ བདེ་ མྱོང་བ འི །_། སྙོམས་པ ར་ སྦྱིན་པ འི་ ལོངས་སྤྱོད་ འཐུན་ འཚལ་བ །_། སེམས་ཅན་ ཀུན་ ལ་ ཕན་པ ར་ གྱུར་ཅིག་ ཅེས །_། སྔོན་ཆད་ བདག་ གིས་ སྦྱིན་ སྩལ་ བསྔོས་ པ་ ལགས །_།
en: $1880 “Previously I dedicated my practice of generosity, saying, ‘May the appropriate and sought-after enjoyments given as alms, By which all beings experience happiness, Benefit all beings!’

source: མགོན་པོ་ དོན་ དེ་ བདག་ ལ་ གསུང་བ ར་ གསོལ །_།
en: $1881 “Savior, please tell me the significance!

source: སྨོན་ལམ་ འདི་འདྲ་ བརྟན་པ འི་ བློ་གྲོས་ ཀྱིའམ །_། དགེ་སློང་ ཕུག་ སྦས་ ཀྱིའམ་ སུ་ ཡི་ ལགས །_།
en: Was such an aspiration Dṛḍhamati’s, Or was it the monk Guhagupta’s?”

source: ཀུན་དགའ་བོ་ བྱང་ཆུབ་ སེམས་དཔའ་ བརྟན་པ འི་ བློ་གྲོས་ ཀྱིས་ དྲི་བ་ འདྲི་བ ར་ འདོད་ ཀྱིས །_ དྲི་བ་ ལན་ གདབ་པ་ ལ་ ཁྱོད་ རེ་ཞིག་ སྡོད་ ཅིག་ དང་ །_ དེ འི་ འོག་ ཏུ་ ཁྱོད་ ཀྱི་ དྲི་བ་ ལན་ གདབ་པ ར་ བྱ འོ །_།
en: “Ānanda, as the bodhisattva Dṛḍhamati wishes to ask a question, wait briefly while I answer his question, and I will then answer yours.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ བརྟན་པ འི་ བློ་ གྲོས་ ཀྱིས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $1883 The bodhisattva Dṛḍhamati then said to the Blessed One,

source: གལ་ཏེ་ ཞུས་ ནས་ ཞུ་བ་ ལུང་བསྟན་པ འི་ སླད་ དུ་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བདག་ ལ་ སྐབས་ ཕྱེ་ ན །_
en: “If, in order to clarify some questions, the Blessed One would allow me the opportunity,

source: བཅོམ་ལྡན་འདས་ བདག་ ཕྱོགས་ འགའ་ཞིག་ ཞུ་ ལགས་སོ །_།
en: I would like to ask the Blessed One about some points.”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ བརྟན་པ འི་ བློ་ གྲོས་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: said the Blessed One to the bodhisattva Dṛḍhamati.

source: བརྟན་པ འི་ བློ་གྲོས་ ཁྱོད་ ཅི་ དང་ ཅི་ འདོད་པ་ དྲིས་ ཤིག་ དང་ །_
en: “Dṛḍhamati, ask whichever questions you wish and

source: ངས་ དེ་ དང་ དེ་ཉིད་ ཀྱི་ དྲི་བ་ ལན་ བཏབ་པ ས་ ཁྱོད་ ཀྱི་ སེམས་ རངས་པ ར་ བྱ འོ །_།
en: I will please your mind with fitting responses,”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ བརྟན་པ འི་ བློ་གྲོས་ ཀྱིས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $1884 The bodhisattva Dṛḍhamati then asked the Blessed One,

source: བཅོམ་ལྡན་ འདས་ སྒོ ར་ འཇུག་པ་ ཞེས་ བགྱི་ ན །_ |#| བཅོམ་ལྡན་འདས་ སྒོ ར་ འཇུག་པ་ ཞེས་ བགྱི་བ་ དེ་ གང་ ལགས །_
en: “Blessed One, what is meant by entering the gateway ?

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ ས་ དེ་ཡང་ བཤད་པ ར་ གསོལ །_
en: Blessed One, could the Thus-Gone One please explain that?

source: གང་དག་ སྒོ འི་ ཚིག་ དག་ ལ་ ཞུགས་པ འི་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ ཀྱང་ བཤད་པ ར་ གསོལ །_ |#| ཆོས་ དེ་དག་ གི་ འཇུག་པ་ [213b] དེ་ཡང་ བཤད་པ ར་ གསོལ །_
en: Please explain as well about bodhisattvas who have entered the words of the gateway, and also about entering into those teachings. [213.b]

source: ཆོས་མཆོག་ དེ་དག་ གང་ཞིག་ ལགས །_།
en: $1885 “What are those supreme teachings?

source: དེ་དག་ འཇུག་པ་ ཇི་ལྟ་བུ །_།
en: How are they entered?

source: དེ་དག་ སྒོ་ ཡང་ ཅི་འདྲ་ ལགས །_།
en: What kind of gateway do they have?

source: འདྲེན་པ་ དེ་བཞིན་ བཤད་པ ར་ གསོལ །_།
en: Guide, please explain accordingly!

source: ཆོས་ ལ་ ཞུགས་ ནས་ ཇི་ལྟ་བུ ར །_། བྱང་ཆུབ་ འབྱུང་བ ར་ འགྱུར་བ་ ལགས །_།
en: $1886 “How, upon entering the Dharma, Will awakening arise?

source: ཇི་ལྟ ར་ ཆོས་ ནི་ བསྟན་པ་ ནས །_། |#| སྤོབས་པ་ ཆད་པ ར་ མི་ འགྱུར་ ལགས །_།
en: How, upon teaching the Dharma, Will one’s eloquence become unimpeded?

source: ཆོས་ དེ་དག་ ནི་ ག་ལ ས་ མཆིས །_།
en: $1887 “Where do those qualities come from?

source: དེ་དག་ གང་ དུ་ གནས་པ་ ལགས །_།
en: Where do they abide?

source: དེ་དག་ ཇི་ལྟ ར་ མི་ རྨོངས་ ཤིང་ །_། ཆོས་ རྣམས་ ལ་ ནི་ དྲན་པ་ འཇུག _།
en: How do we become undeluded about them And apply mindfulness to those qualities?

source: ཅི་ ནས་ དེ་དག་ ཞུགས་ འགྱུར་བ འི །_། འཇུག་པ འི་ མཚན་ཉིད་ བཤད་ དུ་ གསོལ །_།
en: $1888 “By all means please explain the nature of the practice Of those who will enter!

source: ཞུགས་པ་ རྣམས་ ཀྱི་ ཆོས་ གང་དག _། མངོན་དུ་ འགྱུར་བ་ བཤད་པ ར་ གསོལ །_།
en: Please explain the actualization of the qualities Of those who have so entered!

source: དེ་དག་ ཇི་ལྟ ར་ མི་ རྨོངས་ ཤིང་ །_། ཆོས་ ལ་ དྲན་ འབྱུང་ འདྲེན་པ་པོ །_། བསྐལ་པ་ གྲངས་ ནི་ མ་ མཆིས་པ ར །_། སྤོབས་པ་ ཆད་པ ར་ མི་ འགྱུར་ ལགས །_།
en: $1889 “How will we become undeluded about them And gain mindfulness of the Dharma, O Guide, So that eloquence becomes unimpeded For eons beyond number?

source: དེ་དག་ དམིགས་པ་ ཅི་འདྲ་ ཞིག _།
en: $1890 “How should we perceive them?

source: རྟེན་ ཀྱང་ ཇི་ འདྲ་བ་ ཞིག་ ལགས །_།
en: What kind of support do they have?

source: གང་ གིས་ སྨྲ་ བ་ དེ་དག་ གི །_། མཐ ར་ འགྱུར་ མ་ མཆིས་ འདྲེན་པ་པོ །_།
en: What is the means by which Their preaching will never end, O Guide?

source: ཇི་ལྟ ར་ སྔོན་ཆད་ དེ་དག་ གིས །_། སྦྱིན་པ་ སྩལ་ ནས་ |#| ཞི་བ ར་ བསྔོས །_།
en: $1891 “How did those of the past Practice generosity and dedicate it toward peace?

source: གང་ གིས་ གཟི་བརྗིད་ ལྡན་ རྣམས་ ཀྱི །_། སྤོབས་པ་ སྐྱེ་ དང་ མཇལ་བ ར་ འགྱུར །_།
en: By what means will we engender and encounter The eloquence of the charismatic?

source: ཇི་ལྟ་བུ ར་ ནི་ ཚུལ་ཁྲིམས་ བསྲུངས །_།
en: $1892 “How have they observed discipline?

source: ཇི་ལྟ་བུ ར་ ནི་ ཚུལ་ཁྲིམས་ བསྟེན །_།
en: How have they relied upon discipline?

source: ཇི་ལྟ་ བུ ར་ ནི་ ཚུལ་ཁྲིམས་ བསྔོས །_།
en: How have they dedicated discipline?

source: གང་དེ་ ཁྲིམས་ ཀྱིས་ མ་ སོང་ ལགས །_།
en: Which ones did not follow precepts?

source: ཇི་ལྟ་བུ ར་ ན་ བཟོད་པ་ བསྒོམས །_།
en: $1893 “How have they cultivated patience?

source: ཇི་ལྟ་བུ ར་ ན་ བཟོད་པ་ བསྟེན །_།
en: How have they relied upon patience?

source: གང་ གིས་ དེ་དག་ མ་ སྐྱེས་ མཐའ །_། བླ་ ན་མ་ མཆིས་ རྗེས་སུ་ ཐོབ །_།
en: By what means did they achieve The unexcelled limit of the unborn?

source: ཇི་ལྟ་བུ ར་ ན་ བརྩོན་འགྲུས་ བརྩམས །_།
en: $1894 “How have they applied diligence?

source: ཇི་ལྟ་བུ ར་ ན་ བརྩོན་འགྲུས་ བསྟེན །_།
en: How have they relied on diligence?

source: གང་ གིས་ སངས་རྒྱས་ བྱང་ཆུབ་ དང་ །_། བྲལ་བ ར་ མ་ གྱུར་ འདྲེན་པ་པོ །_།
en: By what means have they Not parted from the awakening of the buddhas, O Guide?

source: ཇི་ལྟ་བུ ར་ ན་ བསམ་གཏན་ བསྐྱེད །_།
en: $1895 “How have they generated concentration?

source: ཇི་ལྟ་བུ ར་ ན་ བསམ་གཏན་ བསྟེན །_།
en: How have they relied on concentration?

source: ཆོས་ གང་ ལ་ ནི་ བསམ་གཏན་ བགྱིད །_།
en: Upon which phenomena have they concentrated?

source: གང་ གིས་ སྤོབས་པ་ བསྐྱེད་པ་ ལགས །_།
en: By what means have they engendered eloquence?

source: ཇི་ལྟ ར་ དེ་དག་ ཤེས་རབ་ བསྒོམས །_།
en: $1896 “How have they cultivated insight?

source: ཇི་ལྟ་བུ ར་ ན་ ཤེས་རབ་ བསྟེན །_།
en: How have they relied on insight?

source: ཇི་ ལྟ ར་ དེ་དག་ ཡེ་ཤེས་ འཇུག _།
en: How do they engage wisdom?

source: ཇི་ལྟ ར་ སྤོབས་པ་ ཆད་ མི་ འགྱུར །_། |#| བླ་མེད་ ཚུལ་ ལ་ གནས་པ་ ལགས །_། |#| ཡང་དག་ ཆོས་ རྣམས་ སྟོན་པ་ ལགས །_། |#| ཟབ་ ཅིང་ ཞི་བ་ སྟོང་པ་ ཡི །_། བྱང་ཆུབ་ དེ་ དང་ སུ་ཞིག་ ཉེ །_།
en: How does their eloquence become uninterrupted? |#| $1897 “Who abides by the unexcelled way? |#| Who teaches the authentic Dharma? |#| Who approaches the awakening Of emptiness, profound and peaceful?

source: ཇི་ལྟ ར་ མདོ་སྡེ་ སྣ་ཚོགས་ གཟུང་ །_། |#| སྣ་ཚོགས་ དོན་ ལ་ རྣམ་ ངེས་ ལགས །_། ཡང་ དང་ ཡང་ དུའང་ [214a] སྟོན་ བགྱིད་ ལགས །_།
en: $1898 “How have they received the various sūtras? |#| How have they ascertained their various contents? |#| How have they taught them again and again? [214.a]

source: ཞུ་བ་ དེ་ ནི་ ལན་ སྩལ་ གསོལ །_།
en: Please answer these questions!

source: སེམས་ཅན་ རྣམས་ ཀྱི་ ཐེ་ཚོམ་ གཅོད །_།
en: $1899 “Resolve the doubts of beings!

source: དེ་ ནི་ བདག་ གིས་ སྟོན་ ལ་ ཞུ །_།
en: I request that of the teacher!

source: མ་ མཆིས་པ་ ཡི་ དུས་ ན་ ནི །_། ཆོས་ སྨྲ་བ་ ནི་ འབྱུང་བ ར་ འགྱུར །_།
en: In the future Dharma preachers will appear—

source: ཇི་ལྟ ར་ དེ་ ལ འང་ གནས་པ ར་ བགྱི །_།
en: $1900 “How will they abide by the teachings?

source: འདྲེན་པ་ ཇི་ལྟ ར་ གནས་ ནས་ སུ །_། ཇི་ ལྟ ར་ ཆོས་ ནི་ བཟུང་ ནས་ སུ །_། ཇི་ལྟ ར་ ཆོས་ ནི་ ཡོངས་སུ་ འཛིན །_།
en: How, O Guide, having abided by the Dharma, And having received it, Will they uphold the Dharma?

source: འཇིག་རྟེན་ མགོན་པོ་ མི་མཆོག་ གིས །_། ཞུས་པ་ དེ་ ནི་ བདག་ ལ་ སྟོན །_།
en: $1901 “Savior of the world, best of humans, Teach me about the questions I have posed!

source: ཕྱི་མ འི་ དུས་ ན་ ཇི་ལྟ་བུ ར །_། སྲོག་ཆགས་ རྣམས་ ཀྱི་ ཐེ་ཚོམ་ གཅད །_།
en: How in the future Will you resolve the doubts of beings?”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བརྟན་པ འི་ བློ་གྲོས་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: replied the Blessed One to the bodhisattva Dṛḍhamati.

source: བརྟན་པ འི་ བློ་གྲོས་ ཁྱོད་ དེ་བཞིན་ གཤེགས་པ་ ལ་དོན་ དེ་ ཡོངས་སུ་ འདྲི་བ ར་ སེམས་པ་ ནི་ ལེགས་ སོ་ ལེགས་ སོ །_།
en: $1902 “Dṛḍhamati, excellent!” |#| “It is excellent that you thought to ask the Thus-Gone One about those topics!

source: འདི་ལྟར་ ཁྱོད་ ཀྱིས་ ནི་ སྔོན་ གྱི་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་ རྒྱས་ རྣམས་ ལ་ དགེ་བ འི་ རྩ་བ་ བྱས་ སོ །_།
en: In the same way you have also formed roots of virtue before previous thus-gone ones, worthy ones, perfect buddhas, and

source: དེ་བཞིན་ གཤེགས་པ་ དེ་དག་ ལ་ ཡང་ ཡོངས་སུ་ ཞུས་ སོ །_།
en: you also put questions to those thus-gone ones.

source: བརྟན་པ འི་ བློ་གྲོས་ ངས་ ནི་ འདས་པ འི་ དུས་བསྐལ་པ་ གྲངས་མེད་ པ་ ན་ ནམ་མཁ ས་ ཡོངས་སུ་ ཟིན་པ འི་ ས་ཕྱོགས་ འདི་ཉིད་ དུ་ སངས་རྒྱས་ སྟོང་ཕྲག་ དྲུག་ཅུ་ རྩ་ བརྒྱད་ ལ་ ཁྱོད་ ཀྱིས་ ཞུ་བ་ གང་ ཞུས་པ་ དང་ །_ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ རྣམས་ ལ་ ཁྱོད་ ཀྱི་ ཞུ་བ་ དེ་ ཞུ་བ་ ན་ ཡང་ སེམས་ཅན་ མང་པོ་ དཔག་ ཏུ་ མེད་པ འི་ དོན་ དུ་ གྱུར་པ ར་ མངོན་པར་ ཤེས་ སོ །_།
en: Dṛḍhamati, I remember countless eons ago, on this very spot of earth, your putting the same questions to sixty-eight thousand buddhas; |#| and as you put them to all those thus-gone ones, worthy ones, perfect buddhas, it came to be of benefit to immeasurably many beings.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་ལྟ་བས་ན་ རྣམ་ གྲངས་ དེས་ ཁྱོད་ ཀྱིས་ འདི་ལྟར་ རིག་པ ར་ བྱ་ སྟེ །_
en: $1903 “Therefore, Dṛḍhamati, with that in mind you should understand the following:

source: བརྟན་པ འི་ བློ་ གྲོས་ སྔོན་བྱུང་བ་ འདས་པ འི་ དུས་བསྐལ་པ་ གྲངས་མེད་ པར་ གྱུར་པ་ ན །_ |#| དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ རིན་པོ་ཆེ་ མངོན་དུ་ འཕགས་པ འི་ འོད་ཟེར་ ཅེས་བྱ་བ་ འཇིག་རྟེན་ དུ་ བྱུང་ སྟེ །_
en: Dṛḍhamati, countless eons ago there appeared in the world a thus-gone one, a worthy one, a perfect buddha called Jewel of Exalted Light.

source: དེ་བཞིན་ གཤེགས་པ་ དེ འི་ ཚེ འི་ ཚད་ ནི་ བསྐལ་པ་ ཕྱེད་ ཐུབ་པ ར་ གྱུར་ ཏོ །_།
en: That thus-gone one’s lifespan was half an eon.

source: བཅོམ་ ལྡན་འདས་ དེ་ གང་དག་ དང་ ཐབས་ཅིག་ ཏུ་ ལྗོངས་རྒྱུ་བ་ མཛད་པ་ དང་ །_ གང་དག་ དང་ ཐབས་ཅིག་ ཏུ་ དབྱར་གནས་ པར་ དམ་བཅའ་ བར་ མཛད་པ་ དེ འི་ དགྲ་བཅོམ་པ་ ཟག་པ་ ཟད་པ་ དག་ ནི་ བྱེ་བ་ ཕྲག་ བདུན་ཅུ་ ཚང་བ ར་ བྱུང་བ ར་ གྱུར་ ཏོ །_།
en: That blessed one had a retinue of seven hundred million worthy ones who had exhausted the defilements. |#| Together with them he would wander the countryside and observe the summer rains retreats.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ འི་ དུས་ ན་ འཛམ་བུ འི་ གླིང་ དེ་ ནི་ ཡངས་ ཤིང་ རྒྱ་ ཆེ་ སྟེ །_ |#| དཔག་ [214b] ཚད་ ཁྲག་ཁྲིག་ འབུམ་ཕྲག་ བདུན་ཅུ་ པར་ གྱུར་ ཏོ །_།
en: Dṛḍhamati, at that time that Jambudvīpa was broad and vast, [214.b] extending across seven billion leagues.

source: དེ འི་ དུས་ ན་ རྒྱལ་པོ་ རྒྱལ་རིགས་ སྤྱི་བོ་ ནས་ དབང་ བསྐུར་བ །_ མཐའ་ བཞི ར་ རྣམ་པར་ རྒྱལ་བ་ སྲུང་བ །_ ཆོས་ དང་ ལྡན་པ །_ ཆོས་ ཀྱི་ རྒྱལ་པོ་ གླིང་བཞི་པ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ དབང་ཕྱུག་ འཁོར་ལོ ས་ སྒྱུར་བ་ མ་སྨད་པ འི་ བསོད་ནམས་ དབང་ ཕྱུག་ ཅེས་བྱ་བ་ བྱུང་བ ར་ གྱུར་ ཏོ །_།
en: There was a universal monarch then called Lord of Irreproachable Merit. |#| He was a coronated king of royal caste, who as a righteous Dharma king with sovereignty over the world of the four continents guarded his dominion over the four borders.

source: དེ འི་ དུས་ ན་ འཛམ་བུ འི་ གླིང་ དེར་ གྲོང་ཁྱེར་ ཆེ་ ཞིང་ རྒྱ་ ཆེ་ སྟེ །_ |#| ཆུ ར་ ནི་ དཔག་ཚད་ བཞི་ བཅུ་པ །_ ཞེང་ དུ་ ནི་ དཔག་ཚད་ སུམ་ཅུ་པ །_ འབྱོར་པ །_ རྒྱས་པ །_ བདེ་བ །_ ལོ་ལེགས་པ །_ ཉམས་ དགའ་བ །_ སྐྱེ་བོ་ དང་ མི་ མང་པོ ས་ གང་བ་ བྱེ་བ་ ཕྲག་ བརྒྱད་ཅུ་ བྱུང་བ ར་ གྱུར་ ཏོ །_།
en: The Jambudvīpa of that time had eight hundred million large and vast cities, which were each forty by thirty leagues in size. |#| They were all wealthy, healthy, happy, abundant in food, pleasant, and well populated.

source: བརྟན་པ འི་ བློ་གྲོས་ རྒྱལ་པོ་ མ་སྨད་པ འི་ བསོད་ནམས་ དབང་ཕྱུག་ དེ འི་ འཛམ་བུ འི་ གླིང་ གི་ དབུས་ སུ་ གང་ དུ་ རྒྱལ་པོ་ མ་སྨད་པ འི་ བསོད་ནམས་ དབང་ཕྱུག་ གནས་ འཆའ་བ ར་ བྱེད་པ འི་ རྒྱལ་པོ འི་ ཕོ་བྲང་ འཁོར་ ཆེན་པོ་ ཁོ་ར་ ཁོར་ཡུག་ ཏུ་ དཔག་ཚད་ བརྒྱད་ཅུ་ ཡོད་པ་ གྲུ་བཞི་ ལྷམ་པ །_ རྒྱ ར་ དཔག་ཚད་ ཕྱེད་ཕྱེད་ ཀྱང་ མིག་མངས་ རིས་ སུ་ བྲིས་པ་ གཅིག་ བྱུང་བ ར་ གྱུར་ ཏོ །_།
en: $1904 “Dṛḍhamati, at the center of King Lord of Irreproachable Merit’s Jambudvīpa was a huge royal palace where the king resided. |#| The palace was eighty leagues in circumference and checkered in design, with each square a half league in width.

source: བརྟན་པ འི་ བློ་གྲོས་ རྒྱལ་པོ འི་ ཕོ་བྲང་ འཁོར་ དེ འི་ མིང་ ནི་ བདེ་བ་ ཅན་ ཞེས་ བྱ་བ ར་ གྱུར་ ཏོ །_།
en: Dṛḍhamati, that royal palace was called Sukhāvatī .

source: རྒྱལ་པོ འི་ ཕོ་བྲང་ འཁོར་ དེར་ སེམས་ཅན་ དེ་དག་ གིས་ ལོངས་སྤྱོད་པ འི་ ཕྱིར་ བདག་ གི་ མེད་ ཅིང་ ཡོངས་སུ་ འཛིན་པ་ མེད་པ འི་ སྐྱེད་མོས་ཚལ་ ཁོར་ཡུག་ ཏུ་ སྟོང་ཕྲག་ བདུན་ ཅུ་ བྱུང་བ ར་ གྱུར་ ཏོ །_།
en: The royal palace had seventy thousand surrounding gardens that were without owner or proprietor so that beings could enjoy them.

source: བརྟན་པ འི་ བློ་གྲོས་ རྒྱལ་པོ་ མ་སྨད་པ འི་ བསོད་ནམས་ དབང་ཕྱུག་ དེ འི་ རྒྱལ་པོ འི་ ཕོ་བྲང་ འཁོར་ དཔག་ཚད་ བརྒྱད་ཅུ་པ་ དེ་ ཇི་ཙམ་ དུ་ ཆེ་བ ར་ སྐྱེད་མོས་ཚལ་ ཆེན་པོ་ གཅིག་ བྱུང་བ ར་ གྱུར་ ཏེ །_
en: Dṛḍhamati, there was one large garden that was as big as King Lord of Irreproachable Merit’s eighty-league royal palace.

source: སྐྱེད་མོས་ཚལ་ ཆེན་པོ་ དེ་ ནི་ ཤིང་ ཏ་ལ འི་ ཕྲེང་བ་ རིམ་པ་ བདུན་ གྱིས་ བསྐོར་བ ར་ གྱུར་ ཅིང་ དྲིལ་བུ་ གཡེར་ ཀ འི་ དྲ་བ་ རིམ་ བདུན་ དང་ །_ རྟ་བབས་ རིམ་ བདུན་ དང་ །_ རབ་ རིམ་ བདུན་ དང་ །_ འོབས་ རིམ་ བདུན་ གྱིས་ ཁོར་ཡུག་ ཏུ་ བསྐོར་བ ར་ གྱུར་ ཏོ །_།
en: That large garden was surrounded all around by seven rows of palm trees, seven layers of lattices with tiny bells, seven layers of courtyards, seven walls, and seven moats.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་པོ་ཆེ་ མངོན་དུ་ འཕགས་པ འི་ འོད་ཟེར་ དེ་ དགྲ་བཅོམ་པ་ བྱེ་ བ་ ཕྲག་ བདུན་ཅུ འི་ དགེ་སློང་ གི་ དགེ་འདུན་ ཆེན་པོ་ དང་ ཐབས་ཅིག་ ཏུ་ རིམ་གྱིས་ ཡུལ་ རྒྱུ་བ ས་ རྒྱུ་ ཞིང་ རྒྱལ་པོ འི་ ཕོ་བྲང་ འཁོར་ དུ་ བྱོན་པ ར་ གྱུར་ ཏེ
en: $1905 “Dṛḍhamati, at that time the thus-gone one Jewel of Exalted Light gradually wandered through the area with his large monastic assembly comprised of seven hundred million worthy ones, and eventually they arrived at the royal palace.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ རིན་པོ་ཆེ་ མངོན་དུ་ འཕགས་པ འི་ འོད་ཟེར་ དགེ་སློང་ བྱེ་བ་ ཕྲག་ བདུན་ཅུ་ དང་ ཐབས་ཅིག་ ཏུ་ རིམ་གྱིས་ ཡུལ་ [215a] རྒྱུ་བ་ རྒྱུ་ ཞིང་ རྒྱལ་པོ འི་ ཕོ་བྲང་ འཁོར་ དུ་ བྱོན་ ནས་ |#| དེ་ རྒྱལ་པོ འི་ ཕོ་བྲང་ འཁོར་ དེ |#| འི་ སྐྱེད་མོས་ཚལ་ ཞིག་ ན་ བཞུགས་ སོ །_། |#| ཞེས་ རྒྱལ་པོ་ མ་སྨད་པ འི་ བསོད་ནམས་ དབང་ཕྱུག་ གིས་ ཐོས་ སོ །_།
en: Dṛḍhamati, King Lord of Irreproachable Merit heard that the thus-gone one, the worthy one, the perfect buddha Jewel of Exalted Light had been wandering through the land with his seven hundred million monks [215.a] and that they had now arrived at the royal palace and taken up residence in the garden of the royal palace.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་ནས་ རྒྱལ་པོ་ མ་སྨད་པ འི་ བསོད་ནམས་ དབང་ཕྱུག་ དེ་དེ་ བཞིན་ གཤེགས་ པ་ རིན་པོ་ཆེ་ མངོན་དུ་ འཕགས་པ འི་ འོད་ཟེར་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ ཕྱིན་ ནས །_ |#| བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ་ ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ གོ །_།
en: So, Dṛḍhamati, the king went before the thus-gone one Jewel of Exalted Light, prostrated to the Blessed One’s feet, and sat to one side.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་ནས་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ རིན་པོ་ཆེ་ མངོན་དུ་ འཕགས་ པ འི་ འོད་ཟེར་ གྱིས་ རྒྱལ་པོ་ དེ འི་ བསམ་པ་ ཐུགས་ སུ་ ཆུད་ ནས་
en: Dṛḍhamati, the thus-gone one, the worthy one, the perfect buddha Jewel of Exalted Light understood the king’s intention and so

source: བྱང་ཆུབ་ སེམས་དཔ འི་ སྡེ་སྣོད་ ཀྱི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཐེ་ཚོམ་ གཅོད་པ་ དེ་ཡང་ དག་པ ར་ རབ་ཏུ་ བསྟན་ ཏོ །_།
en: he fully taught him a Dharma discourse of the Bodhisattva Collection, which resolves the doubts of all beings.

source: དེས་ དེ་ ཐོས་ ནས་ ཡི་ རངས་ ཤིང་ རབ་ཏུ་ དགའ་བ ར་ གྱུར་ ཏེ །_ |#| དགའ་བ་ དང་ ཡིད་ བདེ་བ་ སྐྱེས་པ ར་ གྱུར་ ཏོ །_། |#| དེ་ནས་ དེ་ འདི་ སྙམ་ དུ་ སེམས་ ཏེ །_
en: Upon hearing it, the king experienced joy and happiness and became elated and enraptured, so that he thought to himself,

source: དེ་བཞིན་ གཤེགས་པ་ རིན་པོ་ཆེ་ མངོན་དུ་ འཕགས་པ་ དེས་ ལོངས་ སྤྱད་པ འི་ ཕྱིར་ རང་ གི་ སྐྱེད་མོས་ཚལ་ དེ་ ཤིན་ཏུ་ ལེགས་པ ར་ བརྒྱན་ ལ་ བདག་ གིས་ ལེགས་པ ར་ དབུལ་ གོར་མ་ཆག་ གོ་ སྙམ་ ནས་
en: ‘I should most certainly offer my own exquisitely adorned garden for the thus-gone one Jewel of Exalted Light to enjoy.’

source: བརྟན་པ འི་ བློ་གྲོས་ ལོངས་ སྤྱད་པ ར་ བྱ་བ འི་ ཕྱིར་ རྒྱལ་པོ་ དེས་ སྐྱེད་མོས་ཚལ་ དེ་ ཕུལ་ ལོ །_།
en: With this thought, the king offered the garden for the Thus-Gone One to enjoy.

source: གཙུག་ལག་ཁང་ བྱེ་བ་ ཕྲག་ བདུན་ཅུ་ དང་ འཆག་ས་ བྱེ་བ་ ཕྲག་ བདུན་ཅུ་ ཡང་ བྱེད་ དུ་ བཅུག་ གོ །_། |#| ཁྲིའུ་ བྱེ་བ་ ཕྲག་ བདུན་ཅུ་ ཡང་ བྱེད་ དུ་ བཅུག་ གོ །_།
en: The king also commissioned seven hundred million rest houses, seven hundred million promenades, and seven hundred million seats.

source: ཀུན་དགའ་ར་བ་ བྱེ་བ་ ཕྲག་ བདུན་ཅུ་ ཡང་ རིམ་གྲོ་བ་ དག་ དང་ བཅས་པ ར་ ཕུལ་ ཏེ་ ཕུལ་ ནས་ ཀྱང་
en: Having also offered seven hundred million parks, together with attendants,

source: བཅོམ་ལྡན་འདས་ དེ་ག་ ལ་བ་ དེར་ སོང་ སྟེ་ ཕྱིན་ ནས །_ |#| དེ་ བཞིན་ གཤེགས་པ་ དེ་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: he went before the Blessed One and asked,

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བདག་ ལ་ ཐུགས་ བརྩེ་བ འི་ སླད་ དུ་ དགེ་སློང་ གི་ དགེ་འདུན་ དང་ ཐབས་ཅིག་ ཏུ་ སང་ གདུགས་ཚོད་ ལ་ གཤེགས་པ ར་ གནང་ བར་ མཛད་ དུ་ གསོལ །_
en: ‘Out of loving kindness for me, will the Blessed One please deign to come for a meal tomorrow with the assembly of monks?’

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་ནས་ རྒྱལ་པོ་ དེས་ བཅོམ་ལྡན་འདས་ དེ་ ཅང་ མི་ གསུང་བ ར་ གྱུར་པ ས་ གནང་ བར་ རིག་ ནས །_
en: $1906 “Dṛḍhamati, since the Blessed One remained silent, the king understood that he had acquiesced.

source: ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ་ སོང་ ནས་
en: Having prostrated to his feet and taken his leave,

source: དེ འི་ མཚན་མོ་ འཁོར་ལོ ས་ སྒྱུར་བ འི་ ཟས་ ལྟ་བུ་ མང་བ་ དང་ བསོད་པ་ གཡོས་ བྱེད་ དུ་ བཅུག་ ནས །_
en: that night the king ordered the preparation of an abundance of the finest delicacies, fit to be the meal of a universal monarch.

source: དེ འི་ མཚན་མོ་ འདས་པ་ དང་ བཅོམ་ལྡན་འདས་ དེ འི་ ཐད་ དུ་ སོང་ ནས་ གདུགས་ཚོད་ ལ་ བབ་པ་ གསོལ་ ཏོ །_།
en: $1907 “After the night had passed, he went before the Blessed One and made the request for mealtime. [215.b]

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་ནས་ དེ་བཞིན་ [215b] གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ རིན་པོ་ཆེ་ མངོན་དུ་ འཕགས་པ འི་ འོད་ཟེར་ དེ་ སྔ་དྲོ འི་ དུས་ ཀྱི་ ཚེ་ ཤམ་ཐབས་ དང་ ཆོས་གོས་ མནབས །_
en: Dṛḍhamati, the thus-gone one, the worthy one, the perfect buddha Jewel of Exalted Light then donned his lower garment and Dharma robes that morning.

source: ལྷུང་བཟེད་ བསྣམས་ ཏེ་ དགེ་སློང་ གི་ དགེ་འདུན་ གྱིས་ མདུན་ དུ་ བདར་ ནས་
en: Carrying his alms bowl, and escorted by the assembly of monks,

source: རྒྱལ་པོ་ མ་སྨད་པ འི་ བསོད་ནམས་ དབང་ཕྱུག་ གི་ ཁྱིམ་ ག་ལ་བ་ དེར་ གཤེགས་ ཏེ་
en: he went to the palace of King Lord of Irreproachable Merit.

source: བྱོན་ ནས་ |#| གདན་ བཤམས་པ་ ལ་ བཞུགས་ སོ །_།
en: Arriving, he sat down on the cushion set out for him.

source: དགེ་སློང་ དེ་དག་ ཀྱང་ སྟན་ ཇི་ལྟ ར་ བཤམས་པ་ ལ་ འཁོད་ དོ །_།
en: The monks too sat down on their cushions as arranged.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་ནས་ རྒྱལ་པོ་ མ་སྨད་པ འི་ བསོད་ནམས་ དབང་ཕྱུག་ གིས་ བཅོམ་ལྡན་འདས་ དེ་ བཞུགས་པ་ དང་ །_ དགེ་སློང་ གི་ དགེ་འདུན་ འཁོད་པ ར་ རིག་ ནས་
en: Understanding that the Blessed One was seated and that the assembly of monks too were seated,

source: རང་ གི་ ལག་ གིས་ གུས་པ ར་ བྱས་ ཏེ །_ |#| མང་ ཞིང་ བསོད་པ འི་ ཟས་ ཇི་ལྟ ར་ བསྡོགས་པ ས་ ཚིམ་པ ར་ བྱེད་ ཅིང་ བསྟབས་ སོ །_།
en: the king respectfully served the meal of abundant delicacies with his own hands, thus satisfying everyone.

source: དེས་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ རང་ གི་ ལག་ གིས་ གུས་པ ར་ བྱས་ ཏེ་ ཚིམ་པ ར་ བྱས་ ཤིང་ བསྟབས་ ནས །_
en: When he had respectfully served and satisfied the Blessed One with that meal served by his own hands,

source: གསོལ་ ཟིན་ ཅིང་ སྡེར་ གྱུ་ ཕྱག་ བཅབས་པ ར་ རིག་ ནས །_
en: the king noticed that the Blessed One had finished eating and that his hands and bowl were now hidden.

source: བཅོམ་ལྡན་འདས་ དང་ དགེ་སློང་ གི་ དགེ་འདུན་ ལ་སོ་ སོར་ ཆོས་གོས་ གསུམ་ གསུམ་ སྐུ་ལུས་ ལ་ གསོལ་ ཏོ །_།
en: The king then offered three Dharma robes for the body of the Blessed One and each monk in the assembly.
